ruuvi/ruuvitracker_fw/src/platform/stm32f4/gsm.c
  printf("GSM: %s\n", buf);

  m = lookup_urc_message(buf);
  if (m) {
    if (m->next_state) {
      gsm.state = m->next_state;
    }
    if (m->func) {
      m->func(buf);
    }
  }
}

/* Enable GSM module */
void gsm_set_power_state(enum Power_mode mode)
{
  int status_pin = platform_pio_op(STATUS_PORT, STATUS_PIN, PLATFORM_IO_PIN_GET);

  switch(mode) {
  case POWER_ON:
    if (0 == status_pin) {
      gsm_enable_voltage();
      gsm_toggle_power_pin();
      set_hw_flow();
    } else {                    /* Modem already on. Possibly warm reset */
      if (gsm.state == STATE_OFF) {
        gsm_cmd("AT+CPIN?");    /* Check PIN, Functionality and Network status */
        gsm_cmd("AT+CFUN?");    /* Responses of these will feed the state machine */
        gsm_cmd("AT+COPS?");
        gsm_cmd("AT+SAPBR=2,1"); /* Query GPRS status */
        set_hw_flow();
        gsm_cmd("ATE0");
        /* We should now know modem's real status */
        /* Assume that gps is ready, there is no good way to check it */
        gsm.flags |= GPS_READY;
      }
    }
    break;
  case POWER_OFF:
    if (1 == status_pin) {
      gsm_toggle_power_pin();
      gsm.state = STATE_OFF;
    }
    break;
  case CUT_OFF:
    gsm_disable_voltage();
    gsm.state = STATE_OFF;
    break;
  }

}

/* Check if GPS flag is set */
int gsm_is_gps_ready()
{
  if((gsm.flags&GPS_READY) != 0) {
    return TRUE;
  } else {
    return FALSE;
  }
}

int gsm_gprs_enable()
{
  int rc;
  /* Wait for network */
  while(gsm.state < STATE_READY)
    delay_ms(TIMEOUT_MS);

  /* Check if already enabled, response is parsed in URC handler */
  rc = gsm_cmd("AT+SAPBR=2,1");
  if (rc)
    return rc;

  if (gsm.flags&GPRS_READY)
    return 0;

  rc = gsm_cmd("AT+SAPBR=3,1,\"CONTYPE\",\"GPRS\"");
  if (rc)
    return rc;
  rc = gsm_cmd_fmt("AT+SAPBR=3,1,\"APN\",\"%s\"", gsm.ap_name);
  if (rc)
    return rc;
  rc = gsm_cmd("AT+SAPBR=1,1");

  if (AT_OK == rc)
    gsm.flags |= GPRS_READY;
  return rc;
}

int gsm_gprs_disable()
{
  gsm_cmd("AT+SAPBR=2,1");
  if (!(gsm.flags&GPRS_READY))
    return 0; //Was not enabled

  return gsm_cmd("AT+SAPBR=0,1"); //Close Bearer
}

/* -------------------- L U A   I N T E R F A C E --------------------*/

/* COMMON FUNCTIONS */

static int gsm_lua_set_power_state(lua_State *L)
{
  enum Power_mode next = luaL_checkinteger(L, -1);
  gsm_set_power_state(next);
  return 0;
}

static int gsm_power_on(lua_State *L)
{
  gsm_set_power_state(POWER_ON);
  return 0;
}

static int gsm_power_off(lua_State *L)
{
  gsm_set_power_state(POWER_OFF);
  return 0;
}

static int gsm_send_cmd(lua_State *L)
{
  const char *cmd;
  int ret;

  cmd = luaL_checklstring(L, -1, NULL);
  if (!cmd)
    return 0;

  ret = gsm_cmd(cmd);
  lua_pushinteger(L, ret);

  if (ret != AT_OK) {
    printf("GSM: Cmd failed (%s) returned %d\n", cmd, ret);
  }
  return 1;
}

static int gsm_is_pin_required(lua_State *L)
{
  /* Wait for modem to boot */
  while( gsm.state < STATE_ASK_PIN )
    delay_ms(1);		/* Allow uC to sleep */

  lua_pushboolean(L, STATE_ASK_PIN == gsm.state);
  return 1;
}

static int gsm_send_pin(lua_State *L)
{
  int ret;
  char cmd[20];
  const char *pin = luaL_checklstring(L, -1, NULL);
  if (!pin)
    return 0;
  snprintf(cmd,20,"AT+CPIN=%s", pin);

  /* Wait for modem to boot */
  while( gsm.state < STATE_ASK_PIN )
    delay_ms(1);		/* Allow uC to sleep */

  if (STATE_ASK_PIN == gsm.state) {
    ret = gsm_cmd(cmd);
    lua_pushinteger(L, ret);
  } else {
    lua_pushinteger(L, AT_OK);
  }
  return 1;
}

static int gsm_set_apn(lua_State *L)
{
  const char *apn = luaL_checkstring(L, 1);
  strncpy(gsm.ap_name, apn, sizeof(gsm.ap_name));
  return 0;
}

static int gsm_lua_wait(lua_State *L)
{
  int ret,timeout=TIMEOUT_MS;
  char line[256];
  const char *text;
  text = luaL_checklstring(L, 1, NULL);
  if (2 <= lua_gettop(L)) {
       timeout = luaL_checkinteger(L, 2);
  }
  ret = gsm_wait_cpy(text, timeout, line, sizeof(line));
  lua_pushinteger(L, ret);
  lua_pushstring(L, line);
  return 2;
}

static int gsm_state(lua_State *L)
{
  lua_pushinteger(L, gsm.state);
  return 1;
}


static int gsm_is_ready(lua_State *L)
{
  lua_pushboolean(L, gsm.state == STATE_READY);
  return 1;
}

static int gsm_flag_is_set(lua_State *L)
{
  int flag = luaL_checkinteger(L, -1);
  lua_pushboolean(L, (gsm.flags&flag) != 0);
  return 1;
}

static int gsm_get_caller(lua_State *L)
{
  char line[128];
  char number[64];
  gsm_set_raw_mode();
  gsm_uart_write("AT+CLCC" GSM_CMD_LINE_END);
  while(1) {
    gsm_read_line(line, 128);
    if(1 == sscanf(line, "+CLCC: %*d,%*d,4,0,%*d,\"%s", number)) {
      *strchr(number,'"') = 0;
      lua_pushstring(L, number);
      gsm_disable_raw_mode();
      return 1;
    }
    if(0 == strcmp(line, "OK\r\n")) /* End of responses */
      break;
  }
  gsm_disable_raw_mode();
  return 0;
}


/* SMS FUNCTIONS */

static const char ctrlZ[] = {26, 0};
static int gsm_send_sms(lua_State *L)
{
  const char *number;
  const char *text;
  int ret;
  
  number = luaL_checklstring(L, -2, NULL);
  text = luaL_checklstring(L, -1, NULL);
  if (!number || !text)
    return 0;

  if (AT_OK != gsm_cmd("AT+CMGF=1")) {		/* Set to text mode */
    lua_pushinteger(L, AT_ERROR);
    return 1;
  }

  gsm_uart_write("AT+CMGS=\"");
  gsm_uart_write(number);

  gsm_uart_write("\"\r");
  gsm_wait(">", TIMEOUT_MS);	 /* Send SMS cmd and wait for '>' to appear */
  gsm_uart_write(text);
  ret = gsm_cmd(ctrlZ);		/* CTRL-Z ends message. Wait for 'OK' */
  lua_pushinteger(L, ret);
  return 1;
}

static int gsm_read_sms(lua_State *L)
{
  char tmp[256], msg[161], number[100];
  const char *err;
  int r;
  int index = luaL_checkinteger(L, 1);
  gsm_cmd("AT+CMGF=1");         /* Set to text mode */
  gsm_set_raw_mode();
  snprintf(tmp, 161, "AT+CMGR=%d" GSM_CMD_LINE_END, index);
  gsm_uart_write(tmp);
  r = gsm_wait_cpy("\\+CMGR:", TIMEOUT_MS, tmp, sizeof(tmp));
  if (AT_OK != r) {
    printf("GSM: timeout\n");
    gsm_disable_raw_mode();
    return 0;
  }
  /* Example: +CMGR: "REC READ","+358403445818","","13/05/13,18:00:15+12" */
  err = slre_match(0, "^\\+CMGR:\\s\"[^\"]+\",\"([^\"]+)", tmp, strlen(tmp),
                   SLRE_STRING, sizeof(number), number);
  if (NULL != err) {
    printf("GSM: Error parsing \"%s\": %s\n", tmp, err);
    gsm_disable_raw_mode();
    return 0;
  }
  msg[0] = 0;
  tmp[0] = 0;
  do {
    gsm_read_line(tmp, sizeof(tmp));
    if (0 == strcmp(GSM_CMD_LINE_END, tmp)) /* Stop at empty line */
      break;
    strcat(msg, tmp);
  } while(1);
  gsm_wait("OK", TIMEOUT_MS);
  gsm_disable_raw_mode();

  /* Response table */
  lua_newtable(L);
  lua_pushstring(L, "from");
  lua_pushstring(L, number);
  lua_settable(L, -3);
  lua_pushstring(L, "text");
  lua_pushstring(L, msg);
  lua_settable(L, -3);
  return 1;
}

static int gsm_delete_sms(lua_State *L)
{
  char cmd[20];
  int ret;
  int index = luaL_checkinteger(L, 1);
  snprintf(cmd,64,"AT+CMGD=%d", index);
  ret = gsm_cmd(cmd);
  lua_pushinteger(L, ret);
  return 1;
}


/* HTTP FUNCTIONS */

typedef enum method_t { GET, POST } method_t; /* HTTP methods */

