ruuvi/ruuvitracker_fw/src/platform/stm32f4/gsm.c
static int gsm_http_init(const char *url)
{
  int ret;

  if (AT_OK != gsm_gprs_enable())
    return -1;

  ret = gsm_cmd("AT+HTTPINIT");
  if (ret != AT_OK)
    return -1;
  ret = gsm_cmd("AT+HTTPPARA=\"CID\",\"1\"");
  if (ret != AT_OK)
    return -1;
  ret = gsm_cmd_fmt("AT+HTTPPARA=\"URL\",\"%s\"", url);
  if (ret != AT_OK)
    return -1;
  ret = gsm_cmd("AT+HTTPPARA=\"UA\",\"RuuviTracker/SIM908\"");
  if (ret != AT_OK)
    return -1;
  ret = gsm_cmd("AT+HTTPPARA=\"REDIR\",\"1\"");
  if (ret != AT_OK)
    return -1;
  ret = gsm_cmd("AT+HTTPPARA=\"TIMEOUT\",\"30\"");
  if (ret != AT_OK)
    return -1;
  return 0;
}

static void gsm_http_clean()
{
  if (AT_OK != gsm_cmd("AT+HTTPTERM")) {
    gsm_gprs_disable();         /* This should get it to respond */
  }
}

static int gsm_http_send_content_type(const char *content_type)
{
  return gsm_cmd_fmt("AT+HTTPPARA=\"CONTENT\",\"%s\"", content_type);
}

static int gsm_http_send_data(const char *data)
{
  int r;
  r = gsm_cmd_wait_fmt("DOWNLOAD", TIMEOUT_MS, "AT+HTTPDATA=%d,1000", strlen(data));
  if (AT_OK != r) {
    return r;
  }
  gsm_uart_write(data);
  return gsm_cmd(GSM_CMD_LINE_END);
}

static int gsm_http_handle(lua_State *L, method_t method,
                    const char *data, const char *content_type)
{
  int status=0,len,ret;
  char resp[64];
  const char *url = luaL_checkstring(L, 1);
  char *buf=0;

  if (gsm_http_init(url) != 0) {
    printf("GSM: Failed to initialize HTTP\n");
    goto HTTP_END;
  }

  if (content_type) {
    if (gsm_http_send_content_type(content_type) != 0) {
      printf("GSM: Failed to set content type\n");
      goto HTTP_END;
    }
  }

  if (data) {
    if (gsm_http_send_data(data) != 0) {
      printf("GSM: Failed to send http data\n");
      goto HTTP_END;
    }
  }

  if (GET == method)
    ret = gsm_cmd("AT+HTTPACTION=0");
  else
    ret = gsm_cmd("AT+HTTPACTION=1");
  if (ret != AT_OK) {
    printf("GSM: HTTP Action failed\n");
    goto HTTP_END;
  }

  if (gsm_wait_cpy("\\+HTTPACTION", TIMEOUT_HTTP, resp, sizeof(resp)) == AT_TIMEOUT) {
    printf("GSM: HTTP Timeout\n");
    goto HTTP_END;
  }

  if (2 != sscanf(resp, "+HTTPACTION:%*d,%d,%d", &status, &len)) { /* +HTTPACTION:<method>,<result>,<lenght of data> */
    printf("GSM: Failed to parse response\n");
    goto HTTP_END;
  }

  /* Read response, if there is any */
  if (len < 0)
    goto HTTP_END;

  if (NULL == (buf = malloc(len+1))) {
    printf("GSM: Out of memory\n");
    status = 602;               /* HTTP: Out of memory */
    goto HTTP_END;
  }
  
  //Now read all bytes. block others from reading.
  gsm_set_raw_mode();
  gsm_uart_write("AT+HTTPREAD" GSM_CMD_LINE_END); //Read cmd
  gsm_wait_cpy("\\+HTTPREAD", TIMEOUT_MS, resp, sizeof(resp)); //Wait for header
  /* Rest of bytes are data */
  if (len != gsm_read_raw(buf, len)) {
    printf("GSM: Timeout waiting for HTTP DATA\n");
    free(buf);
    buf = 0;
    goto HTTP_END;
  }
  buf[len]=0;

HTTP_END:
  gsm_disable_raw_mode();
  gsm_http_clean();

  /* Create response structure */
  lua_newtable(L);
  lua_pushstring(L, "status");
  lua_pushinteger(L, status);
  lua_settable(L, -3);
  if (buf) {
    lua_pushstring(L, "content");
    lua_pushstring(L, buf);
    lua_settable(L, -3);
  }
  lua_pushstring(L, "is_success" );
  lua_pushboolean(L, ((200 <= status) && (status < 300))); /* If HTTP response was 2xx */
  lua_settable(L, -3);
  return 1;
}

static int gsm_http_get(lua_State *L)
{
  return gsm_http_handle(L, GET, NULL, NULL);
}

static int gsm_http_post(lua_State *L)
{
  const char *data = luaL_checkstring(L, 2); /* 1 is url, it is handled in http_handle function */
  const char *content_type = luaL_checkstring(L, 3);
  return gsm_http_handle(L, POST, data, content_type);
}


/* TCP FUNCTIONS */

typedef struct socket {
  int con;
  enum {DISCONNECTED, CONNECTED} state;
  struct rbuff *buf;
} socket;

/* Allocate 8 socket (SIM908 max connections) */
#define SIM_MAX_SOCKETS 8
socket sockets[SIM_MAX_SOCKETS];

/* Initialize GSM metatable */
static void gsm_tcp_initialize_meta(lua_State *L)
{
  int index;
  if(0 == luaL_newmetatable(L, "socket_meta")) /* Create our metatable */
    return;                                    /* Already created. */
  index = lua_gettop(L);
  lua_getglobal(L, "gsm");      /* Get gsm.socket to top */
  lua_pushstring(L, "socket");
  lua_gettable(L, -2);               /* Get gsm.socket to top of stack */
  lua_pushvalue(L, -1);              /* Copy it */
  lua_setfield(L, index, "__index"); /* socket_meta.__index = gsm.socket, gsm.socket popped */
  lua_pushstring(L, "close");         /* Get gsm.socket.close */
  lua_gettable(L, -2);
  lua_setfield(L, index, "__gc");    /* socket.meta.__gc = gsm.socket.close */
}

static int gsm_tcp_enable()
{
  int rc = 0;
  while(gsm.state < STATE_READY)
    delay_ms(100);

  if (gsm.flags&TCP_ENABLED)
    return 0;

  rc = gsm_cmd("AT+CIPMUX=1");  /* Multi IP */
  if (rc)
    return rc;
  rc = gsm_cmd("AT+CIPSPRT=1"); /* Report '>' */
  if (rc)
    return rc;
  rc = gsm_cmd("AT+CGATT?");
  if (rc)
    return rc;
  rc = gsm_cmd_fmt("AT+CSTT=\"%s\"", gsm.ap_name);
  if (rc)
    return rc;
  rc = gsm_cmd("AT+CIICR");
  if (rc)
    return rc;
  rc = gsm_cmd_wait("AT+CIFSR", "\\d+.\\d+.\\d+.\\d", TIMEOUT_MS);
  if (!rc)
    gsm.flags |= TCP_ENABLED;
  return rc;
}

static void gsm_tcp_end()
{
  gsm_cmd_wait("AT+CIPSHUT", "SHUT OK", TIMEOUT_MS);
}

enum MODE { TCP, UDP };
static int gsm_tcp_connect(lua_State *L)
{
  int i,rc;
  int mode = TCP;
  socket *s = 0;

  const char *addr = luaL_checkstring(L,1);
  const int port = luaL_checkinteger(L,2);
  if (3 == lua_gettop(L))
    mode = luaL_checkinteger(L, 3);

  gsm_tcp_initialize_meta(L);

  if (AT_OK != gsm_tcp_enable()) {
    printf("GSM: Cannot enable GPRS PDP\n");
    gsm_tcp_end();
    return 0;
  }

  /* Find free socket */
  for(i=0;i<SIM_MAX_SOCKETS;i++) {
    if (sockets[i].state == DISCONNECTED) {
      s = &sockets[i];
      s->con = i;
      break;
    }
  }
  if (NULL == s) {
    printf("GSM: No more free sockets\n");
    return 0;
  }

  /* Connect */
  rc = gsm_cmd_fmt("AT+CIPSTART=%d,\"%s\",\"%s\",%d",i,(TCP==mode)?"TCP":"UDP", addr, port);
  rc = gsm_wait("CONNECT OK", 2*TIMEOUT_HTTP);
  if (AT_OK != rc) {
    printf("GSM: Connection failed\n");
    return 0;
  }

  /* Push pointer to socket as a userdata, this allow us to use metatable (lightuserdata have not metatable) */
  *((socket**)lua_newuserdata(L, sizeof(socket*))) = s;
  luaL_getmetatable(L, "socket_meta");
  lua_setmetatable(L, -2);

  /* Prepare socket */
  s->buf = rbuff_new(100); //More memory will be allocated on receive function
  s->state = CONNECTED;
  printf("Connected\n");
  return 1; // lua_newuserdata pushed alredy to stack
}

static int gsm_tcp_clean(int socket)
{
  sockets[socket].state = DISCONNECTED;
  /* Empty receive buffers */
  rbuff_delete(sockets[socket].buf);
  return 0;
}

