ruuvi/ruuvitracker_fw/src/platform/stm32f4/gsm.c
static int gsm_tcp_read(lua_State *L)
{
  int size,i;
  char *p;
  socket *s = *(socket**)luaL_checkudata(L, 1, "socket_meta");

  if (!rbuff_is_empty(s->buf)) {
    if (lua_gettop(L)>=2) {     /* Size given */
      size=luaL_checkint(L,2);
      p = malloc(size);
      if (NULL == p) {
        printf("GSM: Out of memory\n");
        return 0;
      }
      i=0;
      while(size) {
        if(rbuff_is_empty(s->buf)) {
          delay_ms(100);
          continue;
        }
        p[i++] = rbuff_pop(s->buf);
        size--;
      }
      lua_pushlstring(L, p, i);
      free(p);
    } else {                    /* No size parameter, read all */
      size = rbuff_len(s->buf);
      p = rbuff_get_raw(s->buf);
      lua_pushlstring(L, p, size);
    }
    return 1;
  }
  return 0;
}

static void socket_receive(char *line)
{
  int n,size,con;
  char c;
  socket *s;

  if(2 == sscanf(line, "+RECEIVE,%d,%d", &con, &size)) {
    gsm_set_raw_mode();
    s = &sockets[con];

    if ((s->buf->size - rbuff_len(s->buf)) > size) { /* Need more space */
      if (!rbuff_grow(s->buf, size + (s->buf->size - rbuff_len(s->buf)))) {
        printf("GSM: Failed to receive socket. Not enough memory\n");
        goto RECV_END;
      }
    }
    for (n=0;n<size;n++) {
      if (0 == gsm_read_raw(&c, 1)) {
        printf("GSM: Socket read failed\n");
        goto RECV_END;
      }
      rbuff_push(s->buf, c);
    }
  }
RECV_END:
  gsm_disable_raw_mode();
}

static int gsm_tcp_write(lua_State *L)
{
  socket *s = *(socket**)luaL_checkudata(L, 1, "socket_meta");
  size_t size;
  const char *str = luaL_checklstring(L, 2, &size);
  char cmd[64];

  if(DISCONNECTED == s->state)
    return luaL_error(L, "Socket disconnected");
  gsm_set_raw_mode();
  snprintf(cmd, 64, "AT+CIPSEND=%d,%d" GSM_CMD_LINE_END, s->con, size);
  gsm_uart_write(cmd);
  if (AT_OK != gsm_wait(">", TIMEOUT_MS) ) {
    printf("Failed to write socket\n");
    return 0;
  }
  gsm_uart_write(str);
  gsm_disable_raw_mode();
  if (AT_TIMEOUT == gsm_wait("SEND OK", TIMEOUT_HTTP)) {
    printf("GSM:Timeout sending socket data\n");
    return 0;
  }
  lua_pushinteger(L, size);
  return 1;
}

static int gsm_tcp_close(lua_State *L)
{
  socket *s = *(socket**)luaL_checkudata(L, 1, "socket_meta");
  if (s->state != DISCONNECTED) {
    gsm_cmd_wait_fmt("CLOSE OK", TIMEOUT_MS, "AT+CIPCLOSE=0,%d", s->con);
    s->state = DISCONNECTED;
  }
  gsm_tcp_clean(s->con);
  return 0;
}

/* Callback from URC */
void socket_closed(char *line)
{
  int s;
  if (1 == sscanf(line,"%d", &s)) {
    sockets[s].state = DISCONNECTED;
  }
}

/******** Export Lua GSM library *********/

#define MIN_OPT_LEVEL 2
#include "lrodefs.h"

/* Functions, Map name to func.*/
#define F(name,func) { LSTRKEY(#name), LFUNCVAL(func) }

const LUA_REG_TYPE socket_map[] =
{
  F(read, gsm_tcp_read),
  F(write, gsm_tcp_write),
  F(connect, gsm_tcp_connect),
  F(close, gsm_tcp_close),
};

const LUA_REG_TYPE gsm_map[] =
{
  F(set_power_state, gsm_lua_set_power_state),
  F(is_ready, gsm_is_ready),
  F(flag_is_set, gsm_flag_is_set),
  F(state, gsm_state),
  F(is_pin_required, gsm_is_pin_required),
  F(send_pin, gsm_send_pin),
  F(send_sms, gsm_send_sms),
  F(read_sms, gsm_read_sms),
  F(delete_sms, gsm_delete_sms),
  F(cmd, gsm_send_cmd),
  F(wait, gsm_lua_wait),
  F(power_on, gsm_power_on),
  F(power_off, gsm_power_off),
  F(get_caller, gsm_get_caller),
  F(set_apn, gsm_set_apn),

  /* CONSTANTS */
#define MAP(a) { LSTRKEY(#a), LNUMVAL(a) }
  MAP( POWER_ON ),
  MAP( POWER_OFF ),
  MAP( CUT_OFF ),
  MAP( STATE_OFF),
  MAP( STATE_BOOTING ),
  MAP( STATE_ASK_PIN ),
  MAP( STATE_WAIT_NETWORK ),
  MAP( STATE_READY ),
  MAP( STATE_ERROR ),
  MAP( GPS_READY ),
  MAP( SIM_INSERTED ),
  MAP( GPRS_READY ),
  MAP( INCOMING_CALL ),
  MAP( CALL ),
  { LSTRKEY("OK"), LNUMVAL(AT_OK) },
  { LSTRKEY("FAIL"), LNUMVAL(AT_FAIL) },
  { LSTRKEY("ERROR"), LNUMVAL(AT_ERROR) },
  { LSTRKEY("TIMEOUT"), LNUMVAL(AT_TIMEOUT) },

  /* SOCKET MAP */
  { LSTRKEY("socket"), LROVAL(socket_map) },
  { LNILKEY, LNILVAL }
};

/* Add HTTP related functions to another table */
const LUA_REG_TYPE http_map[] =
{
  F(get, gsm_http_get),
  F(post, gsm_http_post),
  { LNILKEY, LNILVAL }
};

LUALIB_API int luaopen_gsm( lua_State *L )
{
#if LUA_OPTIMIZE_MEMORY > 0
  return 0;
#else
#error "Optimize memory=0 is not supported"
#endif // #if LUA_OPTIMIZE_MEMORY > 0
}

#endif	/* BUILD_GSM */
